[NoCoverage] BooleanLiteral
src/boolean-mapper.ts:6:66
 
 @injectable()
 export class BooleanMapper implements BooleanMapperInterface {
-  public mapper(input: unknown, byDefault: boolean | undefined = false): boolean {
+  public mapper(input: unknown, byDefault: boolean | undefined = true): boolean {
     const value = (input?.toString().trim() || byDefault).toString().toLowerCase();
     return value === "true" || value === "yes" || value === "oui" || value === "si";

[NoCoverage] BlockStatement
src/boolean-mapper.ts:6:82
 
 @injectable()
 export class BooleanMapper implements BooleanMapperInterface {
-  public mapper(input: unknown, byDefault: boolean | undefined = false): boolean {
-    const value = (input?.toString().trim() || byDefault).toString().toLowerCase();
-    return value === "true" || value === "yes" || value === "oui" || value === "si";
-  }
+  public mapper(input: unknown, byDefault: boolean | undefined = false): boolean {}
 }
 

[NoCoverage] LogicalOperator
src/boolean-mapper.ts:7:20
 @injectable()
 export class BooleanMapper implements BooleanMapperInterface {
   public mapper(input: unknown, byDefault: boolean | undefined = false): boolean {
-    const value = (input?.toString().trim() || byDefault).toString().toLowerCase();
+    const value = (input?.toString().trim() && byDefault).toString().toLowerCase();
     return value === "true" || value === "yes" || value === "oui" || value === "si";
   }

[NoCoverage] ConditionalExpression
src/boolean-mapper.ts:7:20
 @injectable()
 export class BooleanMapper implements BooleanMapperInterface {
   public mapper(input: unknown, byDefault: boolean | undefined = false): boolean {
-    const value = (input?.toString().trim() || byDefault).toString().toLowerCase();
+    const value = (false).toString().toLowerCase();
     return value === "true" || value === "yes" || value === "oui" || value === "si";
   }

[NoCoverage] EqualityOperator
src/boolean-mapper.ts:8:51
 export class BooleanMapper implements BooleanMapperInterface {
   public mapper(input: unknown, byDefault: boolean | undefined = false): boolean {
     const value = (input?.toString().trim() || byDefault).toString().toLowerCase();
-    return value === "true" || value === "yes" || value === "oui" || value === "si";
+    return value === "true" || value === "yes" || value !== "oui" || value === "si";
   }
 }

[NoCoverage] LogicalOperator
src/boolean-mapper.ts:8:12
 export class BooleanMapper implements BooleanMapperInterface {
   public mapper(input: unknown, byDefault: boolean | undefined = false): boolean {
     const value = (input?.toString().trim() || byDefault).toString().toLowerCase();
-    return value === "true" || value === "yes" || value === "oui" || value === "si";
+    return value === "true" && value === "yes" || value === "oui" || value === "si";
   }
 }
