[Killed] BlockStatement
src/boolean-mapper-module.ts:7:17
 import { BOOLEAN_MAPPER_TYPE } from "boolean-mapper-type";
 
 export class BooleanMapperModule extends ContainerModule {
-  constructor() {
-    super((bind) => {
-      bind<BooleanMapperInterface>(BOOLEAN_MAPPER_TYPE.BooleanMapper).to(BooleanMapper);
-    });
-  }
+  constructor() {}
 }
 
killedBy: BooleanMapperModule tests should check bind BooleanMapper
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/boolean-mapper-module.ts:8:21
 
 export class BooleanMapperModule extends ContainerModule {
   constructor() {
-    super((bind) => {
-      bind<BooleanMapperInterface>(BOOLEAN_MAPPER_TYPE.BooleanMapper).to(BooleanMapper);
-    });
+    super((bind) => {});
   }
 }
killedBy: BooleanMapperModule tests should check bind BooleanMapper
statusReason: expected false to equal true
