[Killed] StringLiteral
src/boolean-mapper-type.ts:2:29
 export const BOOLEAN_MAPPER_TYPE = {
-  BooleanMapper: Symbol.for("BOOLEAN_MAPPER_TYPE -> BooleanMapperInterface"),
+  BooleanMapper: Symbol.for(""),
 };
 
killedBy: BooleanMapperType tests should check BooleanMapper value
statusReason: expected Symbol() to equal Symbol(BOOLEAN_MAPPER_TYPE -> BooleanMapperInterface)
